app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-14 06:05:08.226709"], ["updated_at", "2015-05-14 06:05:08.226709"]]
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_cart
      @cart = Cart.find(params[:id])