app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-13 14:48:42.744154"], ["updated_at", "2015-05-13 14:48:42.744154"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 11], ["cart_id", 1], ["created_at", "2015-05-13 14:48:42.816090"], ["updated_at", "2015-05-13 14:48:42.816090"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-05-14 05:35:12.627180"], ["id", 7]]
---
  def create
	 product = Product.find(params[:product_id])
	 @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save