app/controllers/orders_controller.rb

  def index
    @orders = Order.order('created_at desc').page(params[:page])
---
SELECT  "orders".* FROM "orders"  ORDER BY created_at desc LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def create
	@order = Order.new(order_params)
	@order.add_line_items_from_cart(@cart)

   respond_to do |format|
		if @order.save
			Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Hwang"], ["address", "GangNam"], ["email", "sskui12@ruby.org"], ["pay_type", "Check"], ["created_at", "2015-05-17 12:56:06.785341"], ["updated_at", "2015-05-17 12:56:06.785341"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 47]]