app/controllers/orders_controller.rb

  def new
    @number = params[:_id]
    @product = Product.where("product_id is ?",@number)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 11]]