app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
  def index
    @products = Product.search(params[:search], params[:page])

    if session[:user_id]
       @users = User.find(params[:user_id])

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    end

    respond_to do |format|
      if @product.save