app/controllers/users_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$Kfw7c2ihPseuHZeF8fhrVekJxJnSvxpTbgr5QeNuUKIed9JpZJu8q"], ["updated_at", "2015-05-14 05:57:28.490532"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)